tutorials/incompressible/icoDyMFoam/movingBlockRBF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p CG
    {
        preconditioner
        {
            type         DIC;
        }
        tolerance        1e-06;
        relTol           0;
    };

    pFinal CG
    {
        preconditioner
        {
            type         DIC;
        }
        tolerance        1e-06;
        relTol           0;
    };

    U BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }
        tolerance        1e-7;
        relTol           0;
    };
}

PISO
{
    checkMeshCourantNo true;
    momentumPredictor yes;

    nCorrectors     4;
    nNonOrthogonalCorrectors 1;

	pRefCell		0;
	pRefValue       0;
}

// ************************************************************************* //
